---
kind: method
id: M:Autodesk.Revit.DB.OverrideGraphicSettings.SetHalftone(System.Boolean)
source: html/1e379671-3cb3-7368-9208-d113ea1c4c09.htm
---
# Autodesk.Revit.DB.OverrideGraphicSettings.SetHalftone Method

Sets the halftone value.

## Syntax (C#)
```csharp
public OverrideGraphicSettings SetHalftone(
	bool halftone
)
```

## Parameters
- **halftone** (`System.Boolean`) - True if the override displays in halftone, false otherwise.

## Returns
Reference to the changed object.